Repository: Winael/Juju-Docs-Sphinx-Edition
Catalog: locale/*/LC_MESSAGES/index.po
Languages: fr

source: Welcome to Juju docs - Sphinx Edition's documentation!
fr: Bienvenue dans la documentation de Juju Edition Sphinx

source: This tutorial will show you how to get started with Juju, including installing, configuring and bootstrapping a new Juju environment. Before you start you will need:
fr: Ce tutoriel vous montrera comment commencer avec Juju, en incluantl'installation, la configuration, et le bootstrap d'un nouvel environnement Juju. Avant de commencer vous aurez besoin de :

source: An Ubuntu, OSX or Windows machine to install the client on.
fr: Ubuntu, OSX ou une machine Windows pour y installer le client.

source: An environment which can provide a new server with an Ubuntu cloud operating system image on-demand. This includes services such as Amazon EC2, HP Cloud, an OpenStack installation, or your local machine
fr: Un environnement qui peut fournir un nouveau serveur avec une image du système d'exploitation Ubuntu pour nuage sur demande. Cela comprend les services tels que Amazon EC2, HP Cloud, une installation d'OpenStack, ou votre machine locale.

source: To install Juju, you simply need to grab the latest juju-core package from the PPA:
fr: Pour installer Juju, il vous suffit de récupérer le dernier paquet juju-coredu PPA :

source: Juju is in `Homebrew`_, to install do:
fr: Juju est dans `Homebrew` _, pour l'installer faire :

source: Download and run the `Juju windows installer from here.`_
fr: Téléchargez et exécutez l' `installateur de Juju pour Windows ici`. _

source: Configuring
fr: Configuration

source: To generate an initial config file, you simply need to run:
fr: Pour générer un fichier de configuration initial, il vous suffit de lancer:

source: This command will cause a file to be written to your ~/.juju directory if an environments.yaml file does not already exist. It will also create the ~./juju directory if that does not exist.
fr: Cette commande provoquera un fichier à écrire dans votre répertoire de juju ~ /. S'il n'existe pas déjà un fichier environments.yaml. Il permettra également de créer le répertoire ~. / Juju si cela n'existe pas.

source: This file will contain sample profiles for different types of cloud services, but you will need to edit the files to provide specific information for your cloud provider. Sections are created for Amazon (AWS) services, HPCloud and a generic OpenStack instance (and for the local provider if running on Linux). For more specifics on what needs to be changed, see the relevant sections below.
fr: Ce fichier contient les profils échantillons pour différents types de services de cloud computing, mais vous devez modifier les fichiers de fournir des informations spécifiques à votre fournisseur de cloud. Les articles sont créés pour Amazon Les Services (AWS), HPCloud et une instance de OpenStack générique (et pour le fournisseur local si vous travaillez sur Linux). Pour plus de détails sur ce qui doit être changé, voir les sections pertinentes ci-dessous.

source: `Configuring for Amazon AWS`_
fr: `Configurer pour Amazon AWS` _

source: `Configuring for Windows Azure`_
fr: `Configurer pour Windows Azure` _

source: `Configuring for HP Cloud`_
fr: `Configuration pour HP Cloud` _

source: `Configuring for OpenStack`_
fr: `Configurer pour OpenStack` _

source: `Configuring for MAAS`_
fr: `Configurer pour MAAS` _

source: `Configuring for LXC local provider (Linux)`_
fr: `Configurer pour LXC fournisseur local (Linux)` _

source: Testing your setup
fr: Test de votre configuration

source: Once you have installed and configured Juju, it is probably a good idea to take it for a bit of a test drive and check that everything is working as expected. Because Juju makes it really easy to deploy services, this is actually quick and straightforward.
fr: Une fois que vous avez installé et configuré Juju, il est probablement une bonne idée de prendre un peu d'un essai et vérifier que tout fonctionne comme prévu. Parce que Juju, il est vraiment facile à déployer des services, c'est en fait simple et rapide.

source: The first thing to do is set up a bootstrap environment. This is an instance in the cloud that Juju will use to deploy and control other services with. It will be created according to the configuration you have provided, and your SSH key will automatically be uploaded so that Juju can communicate securely with the bootstrap instance.
fr: La première chose à faire est de mettre en place un environnement de démarrage. Ceci est un exemple dans le nuage que Juju va utiliser pour déployer et contrôler d'autres services avec. Il sera créé selon la configuration que vous avez fourni, et votre clé SSH sera automatiquement téléchargé afin que Juju peut communiquer en toute sécurité avec l'instance de démarrage.

source: You may have to wait a few moments for this command to return, as it needs to perform various tasks and contact your cloud provider.
fr: Vous pourriez avoir à attendre quelques instants pour cette commande pour revenir, car il a besoin pour effectuer diverses tâches et contactez votre fournisseur de cloud.

source: To start with, we will deploy Wordpress, by running this command:
fr: Pour commencer, nous allons déployer Wordpress, en exécutant cette commande:

source: Now juju will fetch the Wordpress charm and use it, through the bootstrap instance to request and deploy whatever resources it needs to set up this service.
fr: Juju vont maintenant chercher le charme Wordpress et l'utiliser, par exemple le bootstrap à la demande et de déployer toutes les ressources dont elle a besoin pour mettre en place ce service.

source: Wordpress needs a database though, so we will also deploy one of those:
fr: Wordpress a besoin d'une base de données, donc nous allons également déployer un de ceux:

source: Once again, juju will do whatever is necessary to deploy this service for you, and it may take some time for the command to return.
fr: Une fois de plus, juju feront tout ce qui est nécessaire pour déployer ce service pour vous, et il peut prendre un certain temps pour la commande pour revenir.

source: Although we have deployed Wordpress and a MySQL database, they are not linked together in any way yet. To do this we should run:
fr: Bien que nous ayons déployé Wordpress et une base de données MySQL, ils ne sont pas encore reliés entre eux en aucune façon. Pour ce faire, nous devons exécuter:

source: In order to make our Wordpress public, we now need to expose this service:
fr: Afin de rendre notre Wordpress publique, nous devons maintenant exposer ce service:

source: This service will now be configured to respond to web requests, so visitors can see it. But where exactly is it? If we run the juju status command, we will be able to see what services are running, and where they are located.
fr: Ce service va maintenant être configuré pour répondre aux requêtes web, afin que les visiteurs peuvent voir. Mais où est-il exactement? Si nous lançons la commande d'état de juju, nous serons en mesure de voir quels services sont en cours d'exécution, et où ils se trouvent.

source: The output from this command should look something like this:
fr: La sortie de cette commande devrait ressembler à ceci:

source: There is quite a lot of information here. the first section, titled machines: , details all the instances which are currently running. For each you will see the version of Juju they are running, their hostname, instance id and the series or version of Ubuntu they are running.
fr: Il est tout à fait beaucoup d'informations ici. la première section, machines intitulé:, détaille toutes les instances qui sont en cours d'exécution. Pour chaque, vous verrez la version de Juju ils sont en cours d'exécution, leur hôte, ID instance et la série ou la version de Ubuntu ils sont en cours d'exécution.

source: After that, the sections list the services which are currently deployed. The information here differs slightly according to the service and how it is configured. It will however, always list the charm that was used to deploy the service, whether it is exposed or not, its address and whatever relationships exist.
fr: Après cela, les sections répertorient les services qui sont actuellement déployés. Les informations ici diffère légèrement selon le service et comment il est configuré. Il sera toutefois, la liste toujours le charme qui a été utilisé pour déployer le service, s'il est exposé ou non, et quelle que soit son adresse relations existent.

source: From this status readout, we can see that wordpress is exposed and ready. If we simply copy the address into a web browser, we should be able to see it running
fr: De ce statut lecture, nous pouvons voir que wordpress est exposé et prêt. Si nous copions simplement l'adresse dans un navigateur Web, nous devrions être en mesure de le voir courir

source: Congratulations, you have just deployed a service with Juju!
fr: Félicitations, vous venez de déployer un service avec Juju!

source: Now you are ready to deploy whatever service you really want from the 100s available at the `Juju Charm Store.`_
fr: Maintenant, vous êtes prêt à déployer n'importe quel service vous voulez vraiment des 100s disponibles à l'`Juju Charm magasin.` _

source: To remove all current deployments and clear up everything in your cloud, you can run the command:
fr: Pour supprimer tous les déploiements actuels et dissiper tout sur votre nuage, vous pouvez exécuter la commande:

source: This will remove everything, including the bootstrap node.
fr: Cela permettra d'éliminer tout, y compris le nœud de démarrage.

source: To learn more about charms, including configuring options and managing running systems, you should continue to `read the charm documentation.`_
fr: Pour en savoir plus sur les charmes, y compris les options de configuration et la gestion des systèmes en cours d'exécution, vous devez continuer à lire la documentation `de charme.` _
